<?php
include("simple_html_dom.php");//подключаем парсер


/**
 * Отключаем вывод ошибок,чтобы js файлу не передавались сообщения об
 * ошибках и все не крашилось.
 */
error_reporting(E_ERROR);
/**На сервер приходят 10 ссылок
 *
 * Проверяется каждая ссылка,чтобы узнать - есть ли в ней номер телефона или email.
 * Если есть - записываем в массив $arrayCheckSpeed;
 * Возвращаем массив $arrayCheckSpeed для проверки скорости
 *
 * Class server
 */
class server
{
    public $post;//массив ссылок,который пришел для проверки
    public $arrayCheckSpeed;//массив ссылок,у которых будет проверятся скорость загрузки.

    function __construct($post)
    {
        $this->post[] = $post;
    }

    public function parser()
    {
        /*
         * шаблоны для поиска
         */
        $patternPhone = '/[0-9 - +]{10}/';//в нем не уверен
        $patternEmail = '/^(?!(?:(?:\x22?\x5C[\x00-\x7E]\x22?)|(?:\x22?[^\x5C\x22]\x22?)){255,})(?!(?:(?:\x22?\x5C[\x00-\x7E]\x22?)|(?:\x22?[^\x5C\x22]\x22?)){65,}@)(?:(?:[\x21\x23-\x27\x2A\x2B\x2D\x2F-\x39\x3D\x3F\x5E-\x7E]+)|(?:\x22(?:[\x01-\x08\x0B\x0C\x0E-\x1F\x21\x23-\x5B\x5D-\x7F]|(?:\x5C[\x00-\x7F]))*\x22))(?:\.(?:(?:[\x21\x23-\x27\x2A\x2B\x2D\x2F-\x39\x3D\x3F\x5E-\x7E]+)|(?:\x22(?:[\x01-\x08\x0B\x0C\x0E-\x1F\x21\x23-\x5B\x5D-\x7F]|(?:\x5C[\x00-\x7F]))*\x22)))*@(?:(?:(?!.*[^.]{64,})(?:(?:(?:xn--)?[a-z0-9]+(?:-[a-z0-9]+)*\.){1,126}){1,}(?:(?:[a-z][a-z0-9]*)|(?:(?:xn--)[a-z0-9]+))(?:-[a-z0-9]+)*)|(?:\[(?:(?:IPv6:(?:(?:[a-f0-9]{1,4}(?::[a-f0-9]{1,4}){7})|(?:(?!(?:.*[a-f0-9][:\]]){7,})(?:[a-f0-9]{1,4}(?::[a-f0-9]{1,4}){0,5})?::(?:[a-f0-9]{1,4}(?::[a-f0-9]{1,4}){0,5})?)))|(?:(?:IPv6:(?:(?:[a-f0-9]{1,4}(?::[a-f0-9]{1,4}){5}:)|(?:(?!(?:.*[a-f0-9]:){5,})(?:[a-f0-9]{1,4}(?::[a-f0-9]{1,4}){0,3})?::(?:[a-f0-9]{1,4}(?::[a-f0-9]{1,4}){0,3}:)?)))?(?:(?:25[0-5])|(?:2[0-4][0-9])|(?:1[0-9]{2})|(?:[1-9]?[0-9]))(?:\.(?:(?:25[0-5])|(?:2[0-4][0-9])|(?:1[0-9]{2})|(?:[1-9]?[0-9]))){3}))\]))$/iD';

        /*Идем по массиву ссылок
         * цикл для проверки: есть ли на странице номер телефона или email
         *
         */

        for ($i = 0; $i < count($this->post[0]); $i++) {

            if($page = file_get_html($this->post[0][$i]))//сможет ли спарсить сайт
            {
                if ($page && (preg_match($patternPhone, $page) || preg_match($patternEmail, $page))) { //смотрим - подходит нам или нет
                    $this->arrayCheckSpeed[] = $this->post[0][$i]; //если подходит - то записываем в массив
                }

            }

        }
        return $this->arrayCheckSpeed;
    }
}

$server = new server(json_decode($_POST['links'])); //production


print_r((json_encode($server->parser())));//production
?>